//Задача 1. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

Console.WriteLine("Введите чило: ");
int a = Convert.ToInt32(Console.ReadLine());
int a1 = (a/10)%10;
Console.WriteLine("Ответ: "+a1);

//Миссия применить функцию успешно провалена.(Потому что кое-кто ничего не понял.)