// Задача 6. Напишите программу, которая на вход принимает значение, а на выходе показывает обратное значение.

Console.WriteLine("Введите число: ");
double a = Convert.ToUInt32(Console.ReadLine());
double b = 1/a;
Console.Write(b);

//Как говорил Цой:"Требуют ответов наши сердца". 
//Хотя там по другому поётся, но факт остоется фактом, почему эта адская печатная машинка не выдает правильный ответ
//на числах типа (0,25; 0,4) между прочим на калькуляторе всё норм, дайте ответ по этой задаче...пожалуйста...